In [1]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import LabelEncoder

In [35]:
file = "shopping_data.csv"
df_shopping = pd.read_csv(file, encoding="ISO-8859-1")
df_shopping.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [36]:
df_shopping.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [37]:
df_shopping.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 203 entries, 0 to 202
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              203 non-null    int64
 1   Card Member             201 non-null    object
 2   Age                     201 non-null    float64
 3   Annual Income           203 non-null    int64
 4   Spending Score (1-100)  202 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 8.1+ KB

In [38]:
# GOAL IS TO SEE SPENDING HABITS
# find the nulls
for column in df_shopping.columns:
    print(f"Column {column} has {df_shopping[column].isnull().sum()} null values")

Column CustomerID has 0 null values
Column Card Member has 2 null values
Column Age has 2 null values
Column Annual Income has 0 null values
Column Spending Score (1-100) has 1 null values

In [39]:
# drop em
df_shopping = df_shopping.dropna()

In [40]:
# are there duplicates?
print(f"Duplicate entries: {df_shopping.duplicated().sum()}")

Duplicate entries: 0

In [41]:
# remove the column(s) that will not help in seeing spending habits
df_shopping.drop(columns=['CustomerID'], inplace=True)
df_shopping.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [42]:
# convert Card Member column to numeric data type
le = LabelEncoder()
df_shopping['Card Member'] = le.fit_transform(df_shopping['Card Member'])

# OR
# def change_string(member):
#     if member == "Yes":
#         return 1
#     else:
#         return 0
# df_shopping['Card Member'] = df_shopping['Card Member'].apply(change_string)

df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [43]:
# scale annual income since it's way larger than other data points
df_shopping['Annual Income'] = df_shopping['Annual Income'] /1000
df_shopping = df_shopping.rename(columns={'Annual Income':'Annual Income (x1000)'})
df_shopping.head()

   Card Member   Age  Annual Income (x1000)  Spending Score (1-100)
0            1  19.0                   15.0                    39.0
1            1  21.0                   15.0                    81.0
2            0  20.0                   16.0                     6.0
3            0  23.0                   16.0                    77.0
4            0  31.0                   17.0                    40.0

In [44]:
df_shopping = df_shopping.rename(columns={'Card Member':'CardMember',
                                          'Annual Income (x1000)':'AnnualIncome',
                                          'Spending Score (1-100)':'SpendingScore'})
df_shopping.head()

   CardMember   Age  AnnualIncome  SpendingScore
0           1  19.0          15.0           39.0
1           1  21.0          15.0           81.0
2           0  20.0          16.0            6.0
3           0  23.0          16.0           77.0
4           0  31.0          17.0           40.0

In [45]:
# export data for possible future use (csv's are most common)
save_file = "shopping_data_cleaned.csv"
df_shopping.to_csv(save_file, index=False)